import Utils

fileprivate let baseAlphabet = Array("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789")
fileprivate let fancyAlphabets = [
    "𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩0123456789",
    "𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛𝕜𝕝𝕞𝕟𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫𝔸𝔹ℂ𝔻𝔼𝔽𝔾ℍ𝕀𝕁𝕂𝕃𝕄ℕ𝕆ℙℚℝ𝕊𝕋𝕌𝕍𝕎𝕏𝕐ℤ𝟘𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡",
    "𝔞𝔟𝔠𝔡𝔢𝔣𝔤𝔥𝔦𝔧𝔨𝔩𝔪𝔫𝔬𝔭𝔮𝔯𝔰𝔱𝔲𝔳𝔴𝔵𝔶𝔷𝔄𝔅ℭ𝔇𝔈𝔉𝔊ℌℑ𝔍𝔎𝔏𝔐𝔑𝔒𝔓𝔔ℜ𝔖𝔗𝔘𝔙𝔚𝔛𝔜ℨ0123456789",
    "卂𝓫ＣᗪẸƑgʰĮ𝐣ҜŁ𝓂ｎᵒ卩ⓆгＳᵗυ𝓥Ŵ𝕩ⓨŽᵃ𝓫𝒸Ď𝔢ᶠ𝔤卄𝔦ｊｋĹΜⓃ𝐎卩ＱŘⓈŤ𝕌𝔳Ⓦ𝓧𝕪𝓏Ѳ１➁❸４５６❼❽９",
    "ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ０１２３４５６７８９",
    "ꪖ᥇ᥴᦔꫀᠻᧁꫝ꠸꠹ᛕꪶꪑꪀꪮρꪇ᥅ᦓꪻꪊꪜ᭙᥊ꪗƺꪖ᥇ᥴᦔꫀᠻᧁꫝ꠸꠹ᛕꪶꪑꪀꪮρꪇ᥅ᦓꪻꪊꪜ᭙᥊ꪗƺᦲ᧒ᒿᗱᔰƼᦆᒣᲖၦ",
    "𝒶𝒷𝒸𝒹𝑒𝒻𝑔𝒽𝒾𝒿𝓀𝓁𝓂𝓃🌸𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏𝒜𝐵𝒞𝒟𝐸𝐹𝒢𝐻𝐼𝒥𝒦𝐿𝑀𝒩🌞𝒫𝒬𝑅𝒮𝒯𝒰𝒱𝒲𝒳𝒴𝒵💍𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫",
    "ᴀʙᴄᴅᴇꜰɢʜɪᴊᴋʟᴍɴᴏᴘQʀꜱᴛᴜᴠᴡxʏᴢᴀʙᴄᴅᴇꜰɢʜɪᴊᴋʟᴍɴᴏᴘQʀꜱᴛᴜᴠᴡxʏᴢ0123456789",
    "🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉0123456789",
    "a̸̻̰͊̆̽̚͘b̸̥̙̠͚͇̝̤̖̯͐́͐̋̀͂̀̾̐̏c̴͎̻̼̹͕͙͕̟̬̜̿̓͊̇̏d̶̨͚͕͙̼̦̄͑͘è̴̤̙̲̐̀́̈͝f̸̗͚͖͈̈́̓͊̌͗͛̾͑̇g̸̹̹̮̱̖͇͈̔̃͂̏̔̈̉h̵̥̤͉̜̑į̴̛̜͖̥̠̺͎̈̊͂̈́̒͊j̴̻̮̝̝̉̈́̈̂̿̊̀̚ḳ̷͍͗̈̽͆̕͜͠͝l̴͍͖͓͓̦̙̓͝m̶̮̟͚̮̥̩͇͊̓͂̾̑ņ̸̰͕̮̗͈̱̗̮̯͒̓̅́̄̽̊o̷̢͈̣͍̮̠͒̽̏̂p̷̧̺̠̯̲̫̝͎̥̀̃̋̉̆̽́q̸̤͖̭̲̟̟̮̏ṙ̸̡͇̯̖̰̯͓̤̄̃̆͒̌ş̵̯͇̾̐ͅṭ̷̽̄̍́͊̂̚ű̷̪̺̠̈́͌͐͛̊̀͗v̴͔͖̥̣͚̫̰͔͎̿̀w̵̢̼̞̲̫̱͈͔͍̜̑͊͑͑͐̈̕x̴̳̙̣͙͓̿̀̎̈́̈y̶̖͕̭͈̪̖̹̓̽̅̈̿͝͝͝z̶̯̽̀A̵̬͓̺̠̖͓̭̘̱̐̈́̿B̸̨̩͈͎̏̒̂̊̽̎ͅC̴̡̡̤͒͑D̸͚̩̗̲̓̎̀̓͠͝Ë̷̛͔͈͔̳́̅̄̄F̸̼̮͖͍̟̪̜̗͈͈͒͛̐͛͂̒͋̅̓̓G̶̛̋̏̀̓͑̕ͅH̶͇͍̫͉̬͑̕I̴̥̞͛̉̑͑͌͊́͛̈͜J̶͕̕Ķ̷̘͉̯͙̜̈́̅̅̉̂ͅL̴̢̹̤̹̮̟̂̔M̷̡̠̺̲̤͙̓N̸̜̰̮͉̉̊͒̾͝Ȯ̶̧̼̩̤̈́̍P̷̤͍͌͋Q̵̢͎̻̥̺̗̺̜̦̹̿̈̆̒̃͗R̸̜̪̝͖̰͙̝͑̽̊̌͝S̶̺̻̳͎̾͜T̵̙͉̤̭͓̬̩̳͖̜͐͝Ù̶̧̩̇͝V̶͉͕̞̝̾̋͐͋͋̀̋̕W̸̢̠͙̮͓͕̤̠̺͎͋̔͋̀̌X̶̧͈̞̮̺̰̰͆͊̑̈́͆͘Y̸͙͇̲͓̲̝̫̩̟̙͗̍̈́̈́̈̈́̓̄͝͝Z̴̢̻͕͓͈̞͙̼͚̳̽͘0̷̝͓̟̊̔͊̏̈́̏͂͠1̸̲̻̹̍̒2̴͙̝͈̓̋͂̕3̸̱̘͈͌͐̒͑4̷̧̱̟̰͇̭̼͌̄̈́̾͒̈́̿͘͠ͅͅ5̸͔̲̞̹̳͙͎̥́͂͋͛́͜6̶͈̬̯̫̖͚̿̊̎͆̓7̷͈̰̱͙͙̠̈̋̄̈́͘ͅ8̵̨̺̟͔̠̩̣̪̪̆̃̿̈̔̃̂̃͆͝9̶̮̜͉̰̝͙̲̑̀̕͠",
    "🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉0123456789",
    "ₐbcdₑfgₕᵢⱼₖₗₘₙₒₚqᵣₛₜᵤᵥwₓyzₐBCDₑFGₕᵢⱼₖₗₘₙₒₚQᵣₛₜᵤᵥWₓYZ₀₁₂₃₄₅₆₇₈₉",
    "ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ⓪①②③④⑤⑥⑦⑧⑨",
    "ค๒ς๔єŦﻮђเןкɭ๓ภ๏קợгรՇยשฬאץչค๒ς๔єŦﻮђเןкɭ๓ภ๏קợгรՇยשฬאץչ0123456789",
    "αႦƈԃҽϝɠԋιʝƙʅɱɳσρϙɾʂƚυʋɯxყȥABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789",
    "ǟɮƈɖɛʄɢɦɨʝӄʟʍռօքզʀֆȶʊʋաӼʏʐǟɮƈɖɛʄɢɦɨʝӄʟʍռօքզʀֆȶʊʋաӼʏʐ0123456789"
].map(Array.init)

public class FancyTextCommand: StringCommand {
    public let info = CommandInfo(
        category: .fun,
        shortDescription: "Stylizes text using special Unicode symbols",
        requiredPermissionLevel: .basic
    )
    public let outputValueType: RichValueType = .text

    public init() {}

    public func invoke(with input: String, output: any CommandOutput, context: CommandContext) {
        let fancyAlphabet = fancyAlphabets.randomElement()!
        let fancyText = String(input.map { baseAlphabet.firstIndex(of: $0).flatMap { fancyAlphabet[safely: $0] } ?? $0 })
        output.append(fancyText)
    }
}
